Revit 2027 API
HomeCamera.EyePosition Property
 The eye position point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EyePosition { get; }
Public ReadOnly Property EyePosition As XYZ
	Get
public:
property XYZ^ EyePosition {
	XYZ^ get ();
}
member EyePosition : XYZ with get
Property Value
XYZ
See Also
Reference
HomeCamera Class
Autodesk.Revit.DB Namespace